sdaiGetEntity(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns an entity specified by its name.
\param model [in] A model that contains the entity definition.
\param name  [in] A string that contains the entity name.
\returns An entity with specified name.
\code
SdaiModel model = ...;
SdaiEntity entCartesianPoint = sdaiGetEntity(model, "ifccartesianpoint");
\remarks
The function is case insensitive.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiED_NDEF - Entity definition not defined.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.